Notas-de-clase/clase-2022-08-15.md

# &Iacute;ndice

1.  [Java](#orgeda45df)
    1.  [Variables y constantes](#orgc43d3c2)
    2.  [Tipos de datos](#orgaeb707a)
    3.  [Wrappers](#org244d42e)
    4.  [Investigar](#orgab975f6)



<a id="orgeda45df"></a>

# Java


<a id="orgc43d3c2"></a>

## Variables y constantes

Las variables y constantes corresponoded a ciertas ubicaciones en la memoria de la computadora. Toda variable y constante tiene un nombre, tipo, un tamaño (en bytes) y un valor.

    int numberOfCards = 30;

Podemos declarar variables en cualquier parte del código indicando el tipo de dato y el nombre de la variable. Por ejemplo:

    float grade;

Nombres de datos validos: date, dateinit, date<sub>end</sub>.
Nombres de variables no validos: date-init, fecha+end, 3date.

Nota: Utilizaremos la convención camel case y el idioma inglés para la nomenclatura de las variables. Las variables tienen que ser muy descriptivos sin ser largos para aumentar legibilidad (2 o 3 palabras a lo mucho).


<a id="orgaeb707a"></a>

## Tipos de datos

Aunque java es un lenguaje orientado a objetos, existen varios tipos de datos primitivos que conviven con las clases.

Los primitivos empiezan con minúscula (camelCase) y las clases comienzan con mayúscula (UpperCamelCase).

Existen los siguientes tipos de datos primitivos, cada uno con su longitud en bytes.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipos Enteros</th>
<th scope="col" class="org-right">Bytes</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">byte</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-left">char</td>
<td class="org-right">2</td>
</tr>


<tr>
<td class="org-left">short</td>
<td class="org-right">2</td>
</tr>


<tr>
<td class="org-left">int</td>
<td class="org-right">4</td>
</tr>


<tr>
<td class="org-left">long</td>
<td class="org-right">8</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipos Flotantes</th>
<th scope="col" class="org-right">Bytes</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">float</td>
<td class="org-right">4</td>
</tr>


<tr>
<td class="org-left">double</td>
<td class="org-right">8</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipos lógicos</th>
<th scope="col" class="org-right">Bytes</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">boolean</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">byte</td>
<td class="org-left">Almacena números enteros entre -128 a 127</td>
</tr>


<tr>
<td class="org-left">short</td>
<td class="org-left">Almacena números enteros de -32,768 a 767</td>
</tr>


<tr>
<td class="org-left">int</td>
<td class="org-left">Almacena números</td>
</tr>
</tbody>
</table>

    byte numberByte = 1;
    float numberFloat = 10.5f;
    double numberDouble = 10.5;
    boolean dataBoolean = true;
    char dataCharLetter = 'R';
    char dataCharNumberOfAscii = 82;

Además existe la clase String que no es un tipo de dato primitivo.

String message = "Hola Mundo";


<a id="org244d42e"></a>

## Wrappers

Para cada uno de los tipos primitivos existe una clase que lo representa y permite realizar diferentes operaciones relacionadas con el tipo de dato en cuestión. A estas clases se les llama <span class="underline">Wrappers</span>.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo primitivo</th>
<th scope="col" class="org-left">Wrapper</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">bye</td>
<td class="org-left">Byte</td>
</tr>


<tr>
<td class="org-left">char</td>
<td class="org-left">Character</td>
</tr>


<tr>
<td class="org-left">short</td>
<td class="org-left">Short</td>
</tr>


<tr>
<td class="org-left">int</td>
<td class="org-left">Integer</td>
</tr>


<tr>
<td class="org-left">long</td>
<td class="org-left">Long</td>
</tr>
</tbody>
</table>

    int identifier = 1234;
    String identifierString = Integer.toString(identifier);


<a id="orgab975f6"></a>

## Investigar

Condicionales, type casting, wrapper. Verificar que métodos incluyen los wrappers. Esto se puede hacer insertando un punto después de un wrapper en VSCodes.

